[{"id":"alpha-go-game-1__0","labels":["MAINLINE"],"comment":"If there's any recent game that needs no introduction, it's this one.\n\nOn March 9, 2016, the computer Go program 'AlphaGo' defeated Lee Sedol 9p in the first game of the Google DeepMind Challenge Match.\n\nThe match was widely reported in mainstream media around the world, as well as by Go Game Guru. You can read more about game one of this five game match here: https://gogameguru.com/alphago-defeats-lee-sedol-game-1/\n\nLet's have a look at the game!","collisions":[],"isOnMainPath":true,"startingMoveNum":1,"endingMoveNum":1},{"id":"alpha-go-game-1__0__0","labels":["MAINLINE"],"comment":"Lee Sedol played Black.","collisions":[],"isOnMainPath":true,"startingMoveNum":1,"endingMoveNum":1},{"id":"alpha-go-game-1__1__0-6","labels":["MAINLINE"],"comment":"Black started with two 3-4 points, and White established a two star formation with 2 and 4.\n\nAlphaGo seems to be fond of the two star formation, which is a flexible and well balanced opening for White.\n\nCreating a Chinese style opening with A or B is more common for Black, but Lee played an unusual move on the right side with 7.\n\nWith Black 7, it seemed like Lee wanted avoid known openings and test AlphaGo's abilities, but this turned out to be a poor game plan.","collisions":[],"isOnMainPath":true,"startingMoveNum":2,"endingMoveNum":7},{"id":"alpha-go-game-1__7__0-3","labels":["MAINLINE"],"comment":"White's approach at 8 was to be expected, and pincering with Black 9 was natural.\n\nWhite 10 is unusual, but it was a practical move in this situation because White was trying to turn Black A into an inefficient move.","collisions":[],"isOnMainPath":true,"startingMoveNum":8,"endingMoveNum":10},{"id":"alpha-go-game-1__9__1_0-13","labels":["VARIATION"],"comment":"After Black's pincer at A, White 1 starts a joseki.\n\nHowever, the result up to Black 14 looks well balanced for Black, because B becomes an excellent move which develops the right side.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":14},{"id":"alpha-go-game-1__9__1_0-3_1_0-7","labels":["VARIATION"],"comment":"White 5 is an older joseki, but Black develops efficient formations at the top and on the right side with Black 2 to 12.\n\nAs you can see, A strikes a good balance with Black's position in the top right, as well as his stone at B.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":12},{"id":"alpha-go-game-1__10__0-5","labels":["MAINLINE"],"comment":"Responding with Black 11 to 13 was necessary and White 14 was the natural continuation of White's plan, but Black 15 was questionable.\n\nLee wanted to test AlphaGo's fighting skills at the top, but it wasn't a good idea because AlphaGo's reading turned out to be more accurate than Lee expected.","collisions":[],"isOnMainPath":true,"startingMoveNum":11,"endingMoveNum":15},{"id":"alpha-go-game-1__14__1_0-2","labels":["VARIATION"],"comment":"Peeping at Black 1 may feel crass, but Black should consider this alternative.\n\nBlack 3 occupies a key point, supporting both A and B, so it's worth exchanging 1 for 2 in order to play 3. If Black doesn't exchange 1 for 2 first, White can play at C to press Black down.\n\nIf White still peeps at C (after the exchange of 1 for 2) Black will push and cut with D to F. Instead of D, playing the tesuji at F immediately is also possible.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":3},{"id":"alpha-go-game-1__15__0-8","labels":["MAINLINE"],"comment":"White 18 occupied the key point for attack and defense -- dividing both Black A and B -- and the first battle began at the top. The flow of White's stones from 16 to 22 was flawless.\n\nBlack put up a determined resistance with 23, aiming to move out without weakening his stone at A.\n\nWe can now see clearly that Black C isn't working as hard as it could. Black would prefer to move it to D and this was White's plan when she played E and F.","collisions":[],"isOnMainPath":true,"startingMoveNum":16,"endingMoveNum":23},{"id":"alpha-go-game-1__22__1_0","labels":["VARIATION"],"comment":"Capping at Black 1 is a common tactic, and is probably the first instinct for many players, but it shows a lack of strategy in this situation.\n\nPressing Black A with the shoulder hit at White 2 is a calm and powerful haengma, which moves White B out while keeping Black's groups separated. Black's marked stones are still thin and weak.\n\nInstead of Black 1, C is another common shape, but it suffers from the same strategic deficiencies in this case.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":2},{"id":"alpha-go-game-1__23__0","labels":["MAINLINE"],"comment":"The peep at White 24 was a well timed forcing move.","collisions":[],"isOnMainPath":true,"startingMoveNum":24,"endingMoveNum":24},{"id":"alpha-go-game-1__23__1_0-3","labels":["VARIATION"],"comment":"Responding to Black A with the usual moves at 1 and 3 is too simple. Black is aiming to pressure White B with 4 after accumulating enough power with A and 2.\n\nCompared to the previous variation (where Black capped at C) the roles of attacker and defender have been reversed.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":4},{"id":"alpha-go-game-1__23__2_0-13","labels":["VARIATION"],"comment":"If White cuts immediately, with 1 to 3, Black will sacrifice the marked stones with 4 to 10.\n\nAfter 14, White's territory is quite big, but Black's outside position is also strong and powerful.\n\nThe result is even, but AlphaGo had a better plan in the game.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":14},{"id":"alpha-go-game-1__24__0","labels":["MAINLINE"],"comment":"Connecting solidly at Black 25 was necessary, because there were no effective countermeasures.","collisions":[],"isOnMainPath":true,"startingMoveNum":25,"endingMoveNum":25},{"id":"alpha-go-game-1__24__1_0-3","labels":["VARIATION"],"comment":"If Black responds with 1, White 2 and 4 form a good combination, making A and B are miai for White.\n\nBlack shouldn't choose this variation, because it's too easy for White.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":4},{"id":"alpha-go-game-1__25__0-2","labels":["MAINLINE"],"comment":"White 26 was a powerful followup. Commentators and observers were surprised and impressed by AlphaGo's strong combination from 24 to 26, as this was the first time we had seen it play at this level.\n\nBlack 27 looked like overplay, but it was unavoidable. That's because walking out with A doesn't lead to a good result.","collisions":[],"isOnMainPath":true,"startingMoveNum":26,"endingMoveNum":27},{"id":"alpha-go-game-1__26__1_0-5","labels":["VARIATION"],"comment":"Black 1 is safer, but a little passive. White will break through with 2 to 4, and the game will become favorable for White.\n\nEven if Black tries to attack White's marked stones with 5, White 6 offers to trade the marked stones for A.\n\nIf Black continues at B next, White will respond with C to G and the overall trade (including breaking through with 2 and 4) is better for White.\n\nThis is why Lee didn't choose Black 1 in the actual game.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":6},{"id":"alpha-go-game-1__27__0-12","labels":["MAINLINE"],"comment":"After White 28, Black tried to fight back against White's surrounding stones with 31 to 37.\n\nWhite 32 was strong move, which guaranteed a complicated battle.\n\nThe hane at Black 39 was unnecessary, and it became a bad exchange later.","collisions":[],"isOnMainPath":true,"startingMoveNum":28,"endingMoveNum":39},{"id":"alpha-go-game-1__38__1_0-8","labels":["VARIATION"],"comment":"Black should have extended at 1 instead of playing Black 39 at A.\n\nWhite can capture Black's marked stones in a ladder, but Black 3 will enclose White's marked stones in compensation.\n\nWhite can't cut with 4 and 6, because giving up a liberty at 5 allows Black to capture White's cutting stones in a ladder with 7.\n\nIt appears that Lee was concerned about White 2 capturing his marked stones in a ladder, but he didn't have to worry about it since trading with 3 is fine for Black.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":9},{"id":"alpha-go-game-1__38__1-2_0-9","labels":["VARIATION"],"comment":"White 2 is the right haengma in this situation, and Black will still enclose White's three stones with 3.\n\nThis time, White can cut with 4 to 6, and the result of the trade up to Black 11 is playable for both sides.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":11},{"id":"alpha-go-game-1__38__1-3_0-4","labels":["VARIATION"],"comment":"Black could also reinforce the cutting point with 3, as he did in the game.\n\nThe result will still be slightly better for Black than it was in the game, because the bad exchange of A for B (pushing into a knight's move without cutting) is omitted here.\n\n","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":7},{"id":"alpha-go-game-1__39__0-4","labels":["MAINLINE"],"comment":"White 40 and 42 were the right responses, and Black 43 was typical of Lee's style of play.\n\nPlaying at A would be normal, but Lee chose a more dynamic and complicated path with 43. It seems like he thought complicating the game was a better strategy against AlphaGo.","collisions":[],"isOnMainPath":true,"startingMoveNum":40,"endingMoveNum":43},{"id":"alpha-go-game-1__42__1_0-8","labels":["VARIATION"],"comment":"Black could still play 1, and the result would be very similar to the variation we saw for move 39 earlier.\n\nHowever, Lee didn't seem to be satisfied with this result.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":9},{"id":"alpha-go-game-1__43__0-13","labels":["MAINLINE"],"comment":"White 44 was necessary, and Black connected at 45 to continue fighting in the center.\n\nHowever, the earlier exchange of A for B still promised to help White in the upcoming battle, and the game was favorable for White.\n\nWhite 48 was a timely move to attack Black's group at the top, but Black 49 and 55 were the correct responses. Black's group was safe after 55, because connecting with C or living as shown in the following variation was miai.","collisions":[],"isOnMainPath":true,"startingMoveNum":44,"endingMoveNum":56},{"id":"alpha-go-game-1__55__1_0-9","labels":["VARIATION"],"comment":"If White blocks at 1 later, Black will make easily two eyes with 2 to 10.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":10},{"id":"alpha-go-game-1__56__0-5","labels":["MAINLINE"],"comment":"Cutting across the knight's move with White 58 was sharp, and many pros were surprised to see that move.\n\nThe purpose of 58 was to help strengthen and solidify White's surrounding positions by sacrificing his cutting stones around 58.\n\nThis was a high level tactic, and AlphaGo seemingly chose to play this way because the game already favored White. This precision, flexibility and good judgment is what surprised pros who were watching the game.\n\nBlack 61 was somewhat questionable. Black should have extended with A instead.","collisions":[],"isOnMainPath":true,"startingMoveNum":57,"endingMoveNum":61},{"id":"alpha-go-game-1__60__1_0-2","labels":["VARIATION"],"comment":"Black can capture White 58 with 1 and 3, but this fills the liberties of Black's triangled stones, giving White's squared stones more freedom in later fighting.\n\nFurthermore, White can use a ladder breaker to enclose the corner with A or B, which is unbearable for Black.\n\nExchanging Black 1 for White 2 also erases the possibility of forcing at C in sente. As we'll see later, that's important too.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":3},{"id":"alpha-go-game-1__60__2_0-2","labels":["VARIATION"],"comment":"Black should have extended at 1 instead of Black 61.\n\nIf White hits Black's marked stones on the nose with 2, Black will turn at 3 to develop the bottom right.\n\nTherefore, White should push at 3 instead of playing White 2, and Black will have a better chance of attacking White's squared later on in the game.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":3},{"id":"alpha-go-game-1__61__0-5","labels":["MAINLINE"],"comment":"Extending at White 62 was natural, and White paralyzed Black's marked stones with the nose tesuji at 66.","collisions":[],"isOnMainPath":true,"startingMoveNum":62,"endingMoveNum":66},{"id":"alpha-go-game-1__65__1_0-5","labels":["VARIATION"],"comment":"Playing atari at 1 instead of White 66 is an overplay.\n\nBlack 2 makes miai of White 3 and Black 4. If White takes the cutting stone with 3, Black will capture White's marked stones with 4 to 6. A and B are miai for Black next.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":6},{"id":"alpha-go-game-1__66__0-3","labels":["MAINLINE"],"comment":"Black played 67 to take sente, but White 68 was another well timed probe and Black 69 was unavoidable.","collisions":[],"isOnMainPath":true,"startingMoveNum":67,"endingMoveNum":69},{"id":"alpha-go-game-1__68__1_0","labels":["VARIATION"],"comment":"Connecting at Black 1 is a bad style. White will be able to play A or B in sente at any time, so Black's center group will become heavier.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":2},{"id":"alpha-go-game-1__69__0-11","labels":["MAINLINE"],"comment":"White 70 followed the direction of play, and the continuation up to 76 was flawless.\n\nBlack 77 doesn't look urgent, but it appears that Lee was also confident about the game at this stage. He didn't expect that AlphaGo's endgame and counting would be so accurate, because it was only the first game of the match.\n\nBoth White 78 and Black 79 were big approach moves, but White 80 was unexpected.\n\nI was told that AlphaGo evaluated the game as good enough for White after 80, but I don't think that it was the best move in this situation.","collisions":[],"isOnMainPath":true,"startingMoveNum":70,"endingMoveNum":80},{"id":"alpha-go-game-1__79__1_0-2","labels":["VARIATION"],"comment":"Responding in the corner at or around White 1 would be normal, and that would be better for White.\n\nIf Black jumps to 2, which is a good continuation, White can still come back to 3. This is already much better for White compared to the actual game.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":3},{"id":"alpha-go-game-1__79__1-2_0-5","labels":["VARIATION"],"comment":"Moving the marked stones out with 2 to 6 is too much for Black at this stage.\n\nAfter White 7, it will be difficult for Black to manage that group.\n\nIf Black pushes at A next, connecting at B makes miai of C and D.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":7},{"id":"alpha-go-game-1__79__1-2_0-3_1_0-5","labels":["VARIATION"],"comment":"If Black pushes and cuts with 6 to 8, the moves from White 9 to 11 clearly show that White will win the capturing race against Black's five stones (marked).\n\nOmitting White 9 and playing 11 immediately is also possible.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":11},{"id":"alpha-go-game-1__80__0-8","labels":["MAINLINE"],"comment":"Black's double approach at 81 felt great, and White's sequence from 82 to 86 was sophisticated. However, since Black's marked stones were powerful, she didn't have any sharp continuations after 87.\n\nWhite 88 was inevitable, and the progression that started with 81 favored Black. The game was reversed here.\n\n","collisions":[],"isOnMainPath":true,"startingMoveNum":81,"endingMoveNum":88},{"id":"alpha-go-game-1__87__1_0-11","labels":["VARIATION"],"comment":"Continuing with White 1 isn't a suitable tactic in this case.\n\nAs we can see, White's whole group is heavy and unsettled after Black 12.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":12},{"id":"alpha-go-game-1__87__2_0","labels":["VARIATION"],"comment":"If White extends at 1, Black can even enter the corner at 3-3 to steal White's eye potential.\n\nWhite can't capture Black A, so this variation is unacceptable for White.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":2},{"id":"alpha-go-game-1__88__0-5","labels":["MAINLINE"],"comment":"Black's stones flowed smoothly with 89 and 91, and White's marked stones were wasted.\n\nBlack 93 looked alright, but he missed an excellent opportunity to consolidate his lead at this moment.\n\nPerhaps Lee thought he was going to win the game easily, because AlphaGo's moves around here seemed unimpressive.\n\nHowever, this was a dangerous way of thinking, since he didn't really know how strong his opponent was yet.","collisions":[],"isOnMainPath":true,"startingMoveNum":89,"endingMoveNum":93},{"id":"alpha-go-game-1__92__1_0-12","labels":["VARIATION"],"comment":"Black should have peeped at 1 before extending at 3.\n\nIf White still invades the right side at 12, Black can respond with 13. There's no problem on the right side, because Black 1 helps to connect his own stones.\n\nWe will soon see the difference the exchange of 1 for 2 makes, when we review what happened in the actual game.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":13},{"id":"alpha-go-game-1__93__0-10","labels":["MAINLINE"],"comment":"After the sente exchanges from White 94 to Black 101, White invaded the right side with 102. This was an excellent move.\n\nLee hadn't anticipated this, and it looked like he was shocked by AlphaGo's unexpected invasion.\n\nAs a result, White 2 was the winning move, because there weren't any good responses for Black, and neither were there any chances for Black to win the game afterwards.","collisions":[],"isOnMainPath":true,"startingMoveNum":94,"endingMoveNum":103},{"id":"alpha-go-game-1__102__1_0-9","labels":["VARIATION"],"comment":"If Black plays at 1 now, White 2 will be a good followup.\n\nBlack 3 and 5 are normal, but White will cut with 6 and 8 to make miai of A and B.\n\nIf Black had exchanged Black C for White D earlier, there wouldn't be any problems for Black in this variation, because Black could just answer White 10 with E and the cutting point at B wouldn't be exposed (i.e. C would form a tiger's mouth to protect the cutting point).","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":10},{"id":"alpha-go-game-1__102__1_0_1_0-5","labels":["VARIATION"],"comment":"It's a little too late to peep at 3 now. In response, White will capture Black's marked stones on a large scale with 4.\n\nEven if Black cuts at 5, White can easily manage her weak group by harassing Black A,","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":8},{"id":"alpha-go-game-1__103__0-2","labels":["MAINLINE"],"comment":"Black 3 and 5 seemed to be the strongest responses, but the game had already become difficult for Black to manage.","collisions":[],"isOnMainPath":true,"startingMoveNum":104,"endingMoveNum":105},{"id":"alpha-go-game-1__104__1_0-9","labels":["VARIATION"],"comment":"If Black plays 1 to 3, he can capture White's marked stones on the right side.\n\nHowever, White 10 will capture Black A on a large scale, which isn't a fair trade.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":10},{"id":"alpha-go-game-1__104_1_0-9__0-16","labels":["VARIATION"],"comment":"Black 11 is the best move to try to live in the corner, but White won't allow Black to make life. All of Black's corner stones are captured after White 26.\n\nA and B are miai for White, and after that C and D are also miai, so Black dies.","collisions":[],"isOnMainPath":false,"startingMoveNum":11,"endingMoveNum":26},{"id":"alpha-go-game-1__104_1_0-9__0-10_1_0","labels":["VARIATION"],"comment":"If Black hanes at 21, White will extend at 22 and A and B are miai for White.","collisions":[],"isOnMainPath":false,"startingMoveNum":11,"endingMoveNum":22},{"id":"alpha-go-game-1__104_1_0-9__0-10_2_0-5","labels":["VARIATION"],"comment":"This is also a dead shape.","collisions":[],"isOnMainPath":false,"startingMoveNum":11,"endingMoveNum":26},{"id":"alpha-go-game-1__105__0","labels":["MAINLINE"],"comment":"White 6 was premature. It would have been better at A instead.","collisions":[],"isOnMainPath":true,"startingMoveNum":106,"endingMoveNum":106},{"id":"alpha-go-game-1__105__1_0-16","labels":["VARIATION"],"comment":"White should have played at 1 first.\n\nIf Black answers at 2, White can push and cut with 3 and 5. Next, White can make a ko shape with 9 and 11.\n\nIf Black tries to avoid the ko with 12, White 13 is a sharp tesuji which captures his stones. After White 17, there's no way for Black to escape.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":17},{"id":"alpha-go-game-1__105__1_0-12_1_0-3","labels":["VARIATION"],"comment":"Cutting at Black 14 doesn't work either, and White can still capture Black's stones.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":17},{"id":"alpha-go-game-1__105__1_0-10_1_0-5","labels":["VARIATION"],"comment":"Black can consider fighting a ko with 12, but White has a ko threat factory at the top so Black will be in deep trouble.","collisions":[{"color":"WHITE","mvnum":17,"label":"9","collisionStoneColor":"WHITE"}],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":17},{"id":"alpha-go-game-1__106__0-3","labels":["MAINLINE"],"comment":"Black 9 was calm and solid, minimizing Black's loss on the right side.","collisions":[],"isOnMainPath":true,"startingMoveNum":107,"endingMoveNum":109},{"id":"alpha-go-game-1__107__1_0-11","labels":["VARIATION"],"comment":"If White cuts at 1 now, Black will descend at 2 and connect underneath up to 12.\n\nThis result isn't as good for White as the actual game.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":12},{"id":"alpha-go-game-1__108__1_0-7","labels":["VARIATION"],"comment":"If Black still responds with 1, White can cut at 2 and the position transposes to variation we reviewed for move 106 (which was troublesome for Black).","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":8},{"id":"alpha-go-game-1__109__0-10","labels":["MAINLINE"],"comment":"White hit Black's vital point with 10, and Black 11 was inevitable.\n\nBlack 15 was a little slack. It should have been at A instead. If White answers A at B, Black can play elsewhere because White's marked stones will already be captured after the exchange of A for B.\n\nWhite 16 was very big, and Black 17 was a nice move to exploit the aji in the bottom left. However, Black 19 was careless, and it was the last losing move.","collisions":[],"isOnMainPath":true,"startingMoveNum":110,"endingMoveNum":119},{"id":"alpha-go-game-1__118__1_0-6","labels":["VARIATION"],"comment":"Black should have played 1 to 3, to squeeze White.\n\nWhite 4 isn't sente anymore, because the atari at Black 5 is sente for Black and there's no aji inside Black's territory at the bottom.\n\nConsequently, Black has time to reinforce his corner at 7, and continuing to squeeze at either A or B is miai for Black later.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":7},{"id":"alpha-go-game-1__118_1_0-6__0-12","labels":["VARIATION"],"comment":"Even if White attaches at 8 later, Black can capture all of White stones up to 19.\n\nIf White plays at A next, Black quietly extends to B and White's stones are still dead.","collisions":[],"isOnMainPath":false,"startingMoveNum":8,"endingMoveNum":19},{"id":"alpha-go-game-1__118__1_0-2_1_0","labels":["VARIATION"],"comment":"If White ataris at 4 to avoid a tight squeeze, Black will return to the corner with 5. The game would have been very close if this had happened.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":5},{"id":"alpha-go-game-1__119__0-2","labels":["MAINLINE"],"comment":"Black 21 was another slack move. It was too small at this stage.","collisions":[],"isOnMainPath":true,"startingMoveNum":120,"endingMoveNum":121},{"id":"alpha-go-game-1__120__1","labels":["VARIATION"],"comment":"Reinforcing the bottom right corner with Black 1 was more important than capturing White A.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":1},{"id":"alpha-go-game-1__121__0-4","labels":["MAINLINE"],"comment":"White 22 was very big because it aimed to attach at 24 next.\n\nBlack 23 was necessary, to look after Black A, but the game was already becoming difficult for Black.","collisions":[],"isOnMainPath":true,"startingMoveNum":122,"endingMoveNum":125},{"id":"alpha-go-game-1__124__1_0-27","labels":["VARIATION"],"comment":"If Black prevents White from connecting underneath with 1, White will be able to live inside Black's territory.\n\nWhite 12 and 14 are sente moves which help her to make eyes in the center, and 28 ensures that White is alive","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":28},{"id":"alpha-go-game-1__124__1_0-11_1_0-7","labels":["VARIATION"],"comment":"If Black responds at 13, White can create a ko with 14 to 20.\n\nOnce again, this is a picnic ko for White and there's a ko threat factory at the top (starting with A).","collisions":[{"color":"WHITE","mvnum":20,"label":"a","collisionStoneColor":"WHITE"}],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":20},{"id":"alpha-go-game-1__125__0-2","labels":["MAINLINE"],"comment":"Lee chose to extend at Black 27, because he knew that he was behind and wanted to make the game more complicated.","collisions":[],"isOnMainPath":true,"startingMoveNum":126,"endingMoveNum":127},{"id":"alpha-go-game-1__126__1_0-9","labels":["VARIATION"],"comment":"Locally speaking, blocking at Black 1 and taking the corner is the right tactic, but the game would already be decided after White 10.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":10},{"id":"alpha-go-game-1__127__0-2","labels":["MAINLINE"],"comment":"White 28 was good, and Black 29 aimed to separate White's groups and attack White's center dragon.","collisions":[],"isOnMainPath":true,"startingMoveNum":128,"endingMoveNum":129},{"id":"alpha-go-game-1__128__1_0-7","labels":["VARIATION"],"comment":"Blocking at Black 1 is still the right choice locally, but Black has no chance of winning if he follows this path.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":8},{"id":"alpha-go-game-1__129__0-7","labels":["MAINLINE"],"comment":"White lived in the bottom right corner in sente, from 30 to 35, and White 36 settled matters in White's favor.","collisions":[],"isOnMainPath":true,"startingMoveNum":130,"endingMoveNum":136},{"id":"alpha-go-game-1__135__1_0-2","labels":["VARIATION"],"comment":"White 1 would have been better in terms of the endgame, but it appears that AlphaGo chose a simpler move to reduce the number of possibilities remaining in the position.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":3},{"id":"alpha-go-game-1__136__0-6","labels":["MAINLINE"],"comment":"Capturing White A was Black's right, but it wasn't enough to make up for Black's earlier loss in the bottom right corner.","collisions":[],"isOnMainPath":true,"startingMoveNum":137,"endingMoveNum":142},{"id":"alpha-go-game-1__141__1_0-6","labels":["VARIATION"],"comment":"White 1 is the vital point, and playing there instead allows White to aim at reviving the marked stones with 3 to 7 later (because playing Black 2 at 6 isn't sente anymore).\n\nHowever, AlphaGo was satisfied with keeping the game simple and maintaining her lead.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":7},{"id":"alpha-go-game-1__142__0-18","labels":["MAINLINE"],"comment":"After White played A, she had to answer Black 43 at 44. Otherwise, Black would be able to capture the corner with the placement at B.\n\nBlack 47 was the biggest endgame move, but White 50 was also very big and the game was decided.","collisions":[],"isOnMainPath":true,"startingMoveNum":143,"endingMoveNum":160},{"id":"alpha-go-game-1__159__1_0-8","labels":["VARIATION"],"comment":"If the score had been very close, White might have played at 1 instead of White 58 in the game.\n\nEven if Black tries to make a ko with 2, White can live with a double ko from 3 to 7.","collisions":[{"color":"WHITE","mvnum":9,"label":"3","collisionStoneColor":"WHITE"}],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":9},{"id":"alpha-go-game-1__160__0-3","labels":["MAINLINE"],"comment":"White 62 says, \"I've won the game.\"","collisions":[],"isOnMainPath":true,"startingMoveNum":161,"endingMoveNum":163},{"id":"alpha-go-game-1__162__1_0-9","labels":["VARIATION"],"comment":"If Black jumps at 1 to reduce White's territory, White will further reduce Black's territory with 2 to 8.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":10},{"id":"alpha-go-game-1__162__1_0_1_0","labels":["VARIATION"],"comment":"If Black responds at 3 instead, White will come back to 4.","collisions":[],"isOnMainPath":false,"startingMoveNum":1,"endingMoveNum":4},{"id":"alpha-go-game-1__163__0-23","labels":["MAINLINE"],"comment":"Black resigned after move 186.\n\nBlack was ahead by just 1 or 2 points on the board, so he couldn't pay for komi.\n\nAlphaGo won the first game of the Google DeepMind Challenge Match, and it was the most sensational and shocking moment in the Go world for a long time.\n\nAlphaGo demonstrated its good sense of play and accurate reading abilities, along with its near perfect endgame and counting skills.\n\nLee had a good chance in the middle game, but he neglected to peep at A, and White's unexpected invasion at B (White 102) showed AlphaGo's power and strength.\n\nEven though Lee lost this first game, he wasn't particularly disappointed at this stage. That's because he had played some moves to test and get a feel for AlphaGo's strength, and he was still confident that he would win the best five match.\n\nHowever, as the match progressed, he gradually realized that AlphaGo hadn't revealed its true strength in this game either.\n\nI hope you'll enjoy reviewing this game more with this commentary, and if you have any questions or thoughts about the game, please feel free to leave a comment.\n\nThanks,\n\nCommented by Younggil An 8p\n\nhttps://gogameguru.com/","collisions":[],"isOnMainPath":true,"startingMoveNum":164,"endingMoveNum":186}]